[
    {
        "id": "2508.15763v1",
        "title": "Intern-S1: A Scientific Multimodal Foundation Model",
        "authors": [
            "Lei Bai",
            "Zhongrui Cai",
            "Maosong Cao",
            "Weihan Cao",
            "Chiyu Chen",
            "Haojiong Chen",
            "Kai Chen",
            "Pengcheng Chen",
            "Ying Chen",
            "Yongkang Chen",
            "Yu Cheng",
            "Yu Cheng",
            "Pei Chu",
            "Tao Chu",
            "Erfei Cui",
            "Ganqu Cui",
            "Long Cui",
            "Ziyun Cui",
            "Nianchen Deng",
            "Ning Ding",
            "Nanqin Dong",
            "Peijie Dong",
            "Shihan Dou",
            "Sinan Du",
            "Haodong Duan",
            "Caihua Fan",
            "Ben Gao",
            "Changjiang Gao",
            "Jianfei Gao",
            "Songyang Gao",
            "Yang Gao",
            "Zhangwei Gao",
            "Jiaye Ge",
            "Qiming Ge",
            "Lixin Gu",
            "Yuzhe Gu",
            "Aijia Guo",
            "Qipeng Guo",
            "Xu Guo",
            "Conghui He",
            "Junjun He",
            "Yili Hong",
            "Siyuan Hou",
            "Caiyu Hu",
            "Hanglei Hu",
            "Jucheng Hu",
            "Ming Hu",
            "Zhouqi Hua",
            "Haian Huang",
            "Junhao Huang",
            "Xu Huang",
            "Zixian Huang",
            "Zhe Jiang",
            "Lingkai Kong",
            "Linyang Li",
            "Peiji Li",
            "Pengze Li",
            "Shuaibin Li",
            "Tianbin Li",
            "Wei Li",
            "Yuqiang Li",
            "Dahua Lin",
            "Junyao Lin",
            "Tianyi Lin",
            "Zhishan Lin",
            "Hongwei Liu",
            "Jiangning Liu",
            "Jiyao Liu",
            "Junnan Liu",
            "Kai Liu",
            "Kaiwen Liu",
            "Kuikun Liu",
            "Shichun Liu",
            "Shudong Liu",
            "Wei Liu",
            "Xinyao Liu",
            "Yuhong Liu",
            "Zhan Liu",
            "Yinquan Lu",
            "Haijun Lv",
            "Hongxia Lv",
            "Huijie Lv",
            "Qidang Lv",
            "Ying Lv",
            "Chengqi Lyu",
            "Chenglong Ma",
            "Jianpeng Ma",
            "Ren Ma",
            "Runmin Ma",
            "Runyuan Ma",
            "Xinzhu Ma",
            "Yichuan Ma",
            "Zihan Ma",
            "Sixuan Mi",
            "Junzhi Ning",
            "Wenchang Ning",
            "Xinle Pang",
            "Jiahui Peng",
            "Runyu Peng",
            "Yu Qiao",
            "Jiantao Qiu",
            "Xiaoye Qu",
            "Yuan Qu",
            "Yuchen Ren",
            "Fukai Shang",
            "Wenqi Shao",
            "Junhao Shen",
            "Shuaike Shen",
            "Chunfeng Song",
            "Demin Song",
            "Diping Song",
            "Chenlin Su",
            "Weijie Su",
            "Weigao Sun",
            "Yu Sun",
            "Qian Tan",
            "Cheng Tang",
            "Huanze Tang",
            "Kexian Tang",
            "Shixiang Tang",
            "Jian Tong",
            "Aoran Wang",
            "Bin Wang",
            "Dong Wang",
            "Lintao Wang",
            "Rui Wang",
            "Weiyun Wang",
            "Wenhai Wang",
            "Yi Wang",
            "Ziyi Wang",
            "Ling-I Wu",
            "Wen Wu",
            "Yue Wu",
            "Zijian Wu",
            "Linchen Xiao",
            "Shuhao Xing",
            "Chao Xu",
            "Huihui Xu",
            "Jun Xu",
            "Ruiliang Xu",
            "Wanghan Xu",
            "GanLin Yang",
            "Yuming Yang",
            "Haochen Ye",
            "Jin Ye",
            "Shenglong Ye",
            "Jia Yu",
            "Jiashuo Yu",
            "Jing Yu",
            "Fei Yuan",
            "Bo Zhang",
            "Chao Zhang",
            "Chen Zhang",
            "Hongjie Zhang",
            "Jin Zhang",
            "Qiaosheng Zhang",
            "Qiuyinzhe Zhang",
            "Songyang Zhang",
            "Taolin Zhang",
            "Wenlong Zhang",
            "Wenwei Zhang",
            "Yechen Zhang",
            "Ziyang Zhang",
            "Haiteng Zhao",
            "Qian Zhao",
            "Xiangyu Zhao",
            "Xiangyu Zhao",
            "Bowen Zhou",
            "Dongzhan Zhou",
            "Peiheng Zhou",
            "Yuhao Zhou",
            "Yunhua Zhou",
            "Dongsheng Zhu",
            "Lin Zhu",
            "Yicheng Zou"
        ],
        "summary": "In recent years, a plethora of open-source foundation models have emerged,\nachieving remarkable progress in some widely attended fields, with performance\nbeing quite close to that of closed-source models. However, in high-value but\nmore challenging scientific professional fields, either the fields still rely\non expert models, or the progress of general foundation models lags\nsignificantly compared to those in popular areas, far from sufficient for\ntransforming scientific research and leaving substantial gap between\nopen-source models and closed-source models in these scientific domains. To\nmitigate this gap and explore a step further toward Artificial General\nIntelligence (AGI), we introduce Intern-S1, a specialized generalist equipped\nwith general understanding and reasoning capabilities with expertise to analyze\nmultiple science modal data. Intern-S1 is a multimodal Mixture-of-Experts (MoE)\nmodel with 28 billion activated parameters and 241 billion total parameters,\ncontinually pre-trained on 5T tokens, including over 2.5T tokens from\nscientific domains. In the post-training stage, Intern-S1 undergoes offline and\nthen online reinforcement learning (RL) in InternBootCamp, where we propose\nMixture-of-Rewards (MoR) to synergize the RL training on more than 1000 tasks\nsimultaneously. Through integrated innovations in algorithms, data, and\ntraining systems, Intern-S1 achieved top-tier performance in online RL\ntraining.On comprehensive evaluation benchmarks, Intern-S1 demonstrates\ncompetitive performance on general reasoning tasks among open-source models and\nsignificantly outperforms open-source models in scientific domains, surpassing\nclosed-source state-of-the-art models in professional tasks, such as molecular\nsynthesis planning, reaction condition prediction, predicting thermodynamic\nstabilities for crystals. Our models are available at\nhttps://huggingface.co/internlm/Intern-S1.",
        "link": "http://arxiv.org/abs/2508.15763v1"
    },
    {
        "id": "2508.15760v1",
        "title": "LiveMCP-101: Stress Testing and Diagnosing MCP-enabled Agents on Challenging Queries",
        "authors": [
            "Ming Yin",
            "Dinghan Shen",
            "Silei Xu",
            "Jianbing Han",
            "Sixun Dong",
            "Mian Zhang",
            "Yebowen Hu",
            "Shujian Liu",
            "Simin Ma",
            "Song Wang",
            "Sathish Reddy Indurthi",
            "Xun Wang",
            "Yiran Chen",
            "Kaiqiang Song"
        ],
        "summary": "Tool calling has emerged as a critical capability for AI agents to interact\nwith the real world and solve complex tasks. While the Model Context Protocol\n(MCP) provides a powerful standardized framework for tool integration, there is\na significant gap in benchmarking how well AI agents can effectively solve\nmulti-step tasks using diverse MCP tools in realistic, dynamic scenarios. In\nthis work, we present LiveMCP-101, a benchmark of 101 carefully curated\nreal-world queries, refined through iterative LLM rewriting and manual review,\nthat require coordinated use of multiple MCP tools including web search, file\noperations, mathematical reasoning, and data analysis. Moreover, we introduce a\nnovel evaluation approach that leverages ground-truth execution plans rather\nthan raw API outputs, better reflecting the evolving nature of real-world\nenvironments. Experiments show that even frontier LLMs achieve a success rate\nbelow 60\\%, highlighting major challenges in tool orchestration. Detailed\nablations and error analysis further reveal distinct failure modes and\ninefficiencies in token usage, pointing to concrete directions for advancing\ncurrent models. LiveMCP-101 sets a rigorous standard for evaluating real-world\nagent capabilities, advancing toward autonomous AI systems that reliably\nexecute complex tasks through tool use.",
        "link": "http://arxiv.org/abs/2508.15760v1"
    },
    {
        "id": "2508.15757v1",
        "title": "Language-Guided Tuning: Enhancing Numeric Optimization with Textual Feedback",
        "authors": [
            "Yuxing Lu",
            "Yucheng Hu",
            "Nan Sun",
            "Xukai Zhao"
        ],
        "summary": "Configuration optimization remains a critical bottleneck in machine learning,\nrequiring coordinated tuning across model architecture, training strategy,\nfeature engineering, and hyperparameters. Traditional approaches treat these\ndimensions independently and lack interpretability, while recent automated\nmethods struggle with dynamic adaptability and semantic reasoning about\noptimization decisions. We introduce Language-Guided Tuning (LGT), a novel\nframework that employs multi-agent Large Language Models to intelligently\noptimize configurations through natural language reasoning. We apply textual\ngradients - qualitative feedback signals that complement numerical optimization\nby providing semantic understanding of training dynamics and configuration\ninterdependencies. LGT coordinates three specialized agents: an Advisor that\nproposes configuration changes, an Evaluator that assesses progress, and an\nOptimizer that refines the decision-making process, creating a self-improving\nfeedback loop. Through comprehensive evaluation on six diverse datasets, LGT\ndemonstrates substantial improvements over traditional optimization methods,\nachieving performance gains while maintaining high interpretability.",
        "link": "http://arxiv.org/abs/2508.15757v1"
    },
    {
        "id": "2508.15754v1",
        "title": "Dissecting Tool-Integrated Reasoning: An Empirical Study and Analysis",
        "authors": [
            "Yufeng Zhao",
            "Junnan Liu",
            "Hongwei Liu",
            "Dongsheng Zhu",
            "Yuan Shen",
            "Songyang Zhang",
            "Kai Chen"
        ],
        "summary": "Large Language Models (LLMs) have made significant strides in reasoning tasks\nthrough methods like chain-of-thought (CoT) reasoning. However, they often fall\nshort in tasks requiring precise computations. Tool-Integrated Reasoning (TIR)\nhas emerged as a solution by incorporating external tools into the reasoning\nprocess. Nevertheless, the generalization of TIR in improving the reasoning\nability of LLM is still unclear. Additionally, whether TIR has improved the\nmodel's reasoning behavior and helped the model think remains to be studied. We\nintroduce ReasonZoo, a comprehensive benchmark encompassing nine diverse\nreasoning categories, to evaluate the effectiveness of TIR across various\ndomains. Additionally, we propose two novel metrics, Performance-Aware Cost\n(PAC) and Area Under the Performance-Cost Curve (AUC-PCC), to assess reasoning\nefficiency. Our empirical evaluation demonstrates that TIR-enabled models\nconsistently outperform their non-TIR counterparts in both mathematical and\nnon-mathematical tasks. Furthermore, TIR enhances reasoning efficiency, as\nevidenced by improved PAC and AUC-PCC, indicating reduced overthinking and more\nstreamlined reasoning. These findings underscore the domain-general benefits of\nTIR and its potential to advance LLM capabilities in complex reasoning tasks.",
        "link": "http://arxiv.org/abs/2508.15754v1"
    },
    {
        "id": "2508.15746v1",
        "title": "End-to-End Agentic RAG System Training for Traceable Diagnostic Reasoning",
        "authors": [
            "Qiaoyu Zheng",
            "Yuze Sun",
            "Chaoyi Wu",
            "Weike Zhao",
            "Pengcheng Qiu",
            "Yongguo Yu",
            "Kun Sun",
            "Yanfeng Wang",
            "Ya Zhang",
            "Weidi Xie"
        ],
        "summary": "Accurate diagnosis with medical large language models is hindered by\nknowledge gaps and hallucinations. Retrieval and tool-augmented methods help,\nbut their impact is limited by weak use of external knowledge and poor\nfeedback-reasoning traceability. To address these challenges, We introduce\nDeep-DxSearch, an agentic RAG system trained end-to-end with reinforcement\nlearning (RL) that enables steer tracebale retrieval-augmented reasoning for\nmedical diagnosis. In Deep-DxSearch, we first construct a large-scale medical\nretrieval corpus comprising patient records and reliable medical knowledge\nsources to support retrieval-aware reasoning across diagnostic scenarios. More\ncrutially, we frame the LLM as the core agent and the retrieval corpus as its\nenvironment, using tailored rewards on format, retrieval, reasoning structure,\nand diagnostic accuracy, thereby evolving the agentic RAG policy from\nlarge-scale data through RL.\n  Experiments demonstrate that our end-to-end agentic RL training framework\nconsistently outperforms prompt-engineering and training-free RAG approaches\nacross multiple data centers. After training, Deep-DxSearch achieves\nsubstantial gains in diagnostic accuracy, surpassing strong diagnostic\nbaselines such as GPT-4o, DeepSeek-R1, and other medical-specific frameworks\nfor both common and rare disease diagnosis under in-distribution and\nout-of-distribution settings. Moreover, ablation studies on reward design and\nretrieval corpus components confirm their critical roles, underscoring the\nuniqueness and effectiveness of our approach compared with traditional\nimplementations. Finally, case studies and interpretability analyses highlight\nimprovements in Deep-DxSearch's diagnostic policy, providing deeper insight\ninto its performance gains and supporting clinicians in delivering more\nreliable and precise preliminary diagnoses. See\nhttps://github.com/MAGIC-AI4Med/Deep-DxSearch.",
        "link": "http://arxiv.org/abs/2508.15746v1"
    },
    {
        "id": "2508.15721v1",
        "title": "EcomMMMU: Strategic Utilization of Visuals for Robust Multimodal E-Commerce Models",
        "authors": [
            "Xinyi Ling",
            "Hanwen Du",
            "Zhihui Zhu",
            "Xia Ning"
        ],
        "summary": "E-commerce platforms are rich in multimodal data, featuring a variety of\nimages that depict product details. However, this raises an important question:\ndo these images always enhance product understanding, or can they sometimes\nintroduce redundancy or degrade performance? Existing datasets are limited in\nboth scale and design, making it difficult to systematically examine this\nquestion. To this end, we introduce EcomMMMU, an e-commerce multimodal\nmultitask understanding dataset with 406,190 samples and 8,989,510 images.\nEcomMMMU is comprised of multi-image visual-language data designed with 8\nessential tasks and a specialized VSS subset to benchmark the capability of\nmultimodal large language models (MLLMs) to effectively utilize visual content.\nAnalysis on EcomMMMU reveals that product images do not consistently improve\nperformance and can, in some cases, degrade it. This indicates that MLLMs may\nstruggle to effectively leverage rich visual content for e-commerce tasks.\nBuilding on these insights, we propose SUMEI, a data-driven method that\nstrategically utilizes multiple images via predicting visual utilities before\nusing them for downstream tasks. Comprehensive experiments demonstrate the\neffectiveness and robustness of SUMEI. The data and code are available through\nhttps://anonymous.4open.science/r/submission25.",
        "link": "http://arxiv.org/abs/2508.15721v1"
    },
    {
        "id": "2508.15711v1",
        "title": "Stemming -- The Evolution and Current State with a Focus on Bangla",
        "authors": [
            "Abhijit Paul",
            "Mashiat Amin Farin",
            "Sharif Md. Abdullah",
            "Ahmedul Kabir",
            "Zarif Masud",
            "Shebuti Rayana"
        ],
        "summary": "Bangla, the seventh most widely spoken language worldwide with 300 million\nnative speakers, faces digital under-representation due to limited resources\nand lack of annotated datasets. Stemming, a critical preprocessing step in\nlanguage analysis, is essential for low-resource, highly-inflectional languages\nlike Bangla, because it can reduce the complexity of algorithms and models by\nsignificantly reducing the number of words the algorithm needs to consider.\nThis paper conducts a comprehensive survey of stemming approaches, emphasizing\nthe importance of handling morphological variants effectively. While exploring\nthe landscape of Bangla stemming, it becomes evident that there is a\nsignificant gap in the existing literature. The paper highlights the\ndiscontinuity from previous research and the scarcity of accessible\nimplementations for replication. Furthermore, it critiques the evaluation\nmethodologies, stressing the need for more relevant metrics. In the context of\nBangla's rich morphology and diverse dialects, the paper acknowledges the\nchallenges it poses. To address these challenges, the paper suggests directions\nfor Bangla stemmer development. It concludes by advocating for robust Bangla\nstemmers and continued research in the field to enhance language analysis and\nprocessing.",
        "link": "http://arxiv.org/abs/2508.15711v1"
    },
    {
        "id": "2508.15709v1",
        "title": "Position Bias Mitigates Position Bias:Mitigate Position Bias Through Inter-Position Knowledge Distillation",
        "authors": [
            "Yifei Wang",
            "Feng Xiong",
            "Yong Wang",
            "Linjing Li",
            "Xiangxiang Chu",
            "Daniel Dajun Zeng"
        ],
        "summary": "Positional bias (PB), manifesting as non-uniform sensitivity across different\ncontextual locations, significantly impairs long-context comprehension and\nprocessing capabilities. While prior work seeks to mitigate PB through\nmodifying the architectures causing its emergence, significant PB still\npersists. To address PB effectively, we introduce \\textbf{Pos2Distill}, a\nposition to position knowledge distillation framework. Pos2Distill transfers\nthe superior capabilities from advantageous positions to less favorable ones,\nthereby reducing the huge performance gaps. The conceptual principle is to\nleverage the inherent, position-induced disparity to counteract the PB itself.\nWe identify distinct manifestations of PB under \\textbf{\\textsc{r}}etrieval and\n\\textbf{\\textsc{r}}easoning paradigms, thereby designing two specialized\ninstantiations: \\emph{Pos2Distill-R\\textsuperscript{1}} and\n\\emph{Pos2Distill-R\\textsuperscript{2}} respectively, both grounded in this\ncore principle. By employing the Pos2Distill approach, we achieve enhanced\nuniformity and significant performance gains across all contextual positions in\nlong-context retrieval and reasoning tasks. Crucially, both specialized systems\nexhibit strong cross-task generalization mutually, while achieving superior\nperformance on their respective tasks.",
        "link": "http://arxiv.org/abs/2508.15709v1"
    },
    {
        "id": "2508.15658v1",
        "title": "Benchmarking Computer Science Survey Generation",
        "authors": [
            "Weihang Su",
            "Anzhe Xie",
            "Qingyao Ai",
            "Jianming Long",
            "Jiaxin Mao",
            "Ziyi Ye",
            "Yiqun Liu"
        ],
        "summary": "Scientific survey articles play a vital role in summarizing research\nprogress, yet their manual creation is becoming increasingly infeasible due to\nthe rapid growth of academic literature. While large language models (LLMs)\noffer promising capabilities for automating this process, progress in this area\nis hindered by the absence of standardized benchmarks and evaluation protocols.\nTo address this gap, we introduce SurGE (Survey Generation Evaluation), a new\nbenchmark for evaluating scientific survey generation in the computer science\ndomain. SurGE consists of (1) a collection of test instances, each including a\ntopic description, an expert-written survey, and its full set of cited\nreferences, and (2) a large-scale academic corpus of over one million papers\nthat serves as the retrieval pool. In addition, we propose an automated\nevaluation framework that measures generated surveys across four dimensions:\ninformation coverage, referencing accuracy, structural organization, and\ncontent quality. Our evaluation of diverse LLM-based approaches shows that\nsurvey generation remains highly challenging, even for advanced self-reflection\nframeworks. These findings highlight the complexity of the task and the\nnecessity for continued research. We have open-sourced all the code, data, and\nmodels at: https://github.com/oneal2000/SurGE",
        "link": "http://arxiv.org/abs/2508.15658v1"
    },
    {
        "id": "2508.15648v1",
        "title": "SDGO: Self-Discrimination-Guided Optimization for Consistent Safety in Large Language Models",
        "authors": [
            "Peng Ding",
            "Wen Sun",
            "Dailin Li",
            "Wei Zou",
            "Jiaming Wang",
            "Jiajun Chen",
            "Shujian Huang"
        ],
        "summary": "Large Language Models (LLMs) excel at various natural language processing\ntasks but remain vulnerable to jailbreaking attacks that induce harmful content\ngeneration. In this paper, we reveal a critical safety inconsistency: LLMs can\nmore effectively identify harmful requests as discriminators than defend\nagainst them as generators. This insight inspires us to explore aligning the\nmodel's inherent discrimination and generation capabilities. To this end, we\npropose SDGO (Self-Discrimination-Guided Optimization), a reinforcement\nlearning framework that leverages the model's own discrimination capabilities\nas a reward signal to enhance generation safety through iterative\nself-improvement. Our method does not require any additional annotated data or\nexternal models during the training phase. Extensive experiments demonstrate\nthat SDGO significantly improves model safety compared to both prompt-based and\ntraining-based baselines while maintaining helpfulness on general benchmarks.\nBy aligning LLMs' discrimination and generation capabilities, SDGO brings\nrobust performance against out-of-distribution (OOD) jailbreaking attacks. This\nalignment achieves tighter coupling between these two capabilities, enabling\nthe model's generation capability to be further enhanced with only a small\namount of discriminative samples. Our code and datasets are available at\nhttps://github.com/NJUNLP/SDGO.",
        "link": "http://arxiv.org/abs/2508.15648v1"
    },
    {
        "id": "2508.15637v1",
        "title": "Classification errors distort findings in automated speech processing: examples and solutions from child-development research",
        "authors": [
            "Lucas Gautheron",
            "Evan Kidd",
            "Anton Malko",
            "Marvin Lavechin",
            "Alejandrina Cristia"
        ],
        "summary": "With the advent of wearable recorders, scientists are increasingly turning to\nautomated methods of analysis of audio and video data in order to measure\nchildren's experience, behavior, and outcomes, with a sizable literature\nemploying long-form audio-recordings to study language acquisition. While\nnumerous articles report on the accuracy and reliability of the most popular\nautomated classifiers, less has been written on the downstream effects of\nclassification errors on measurements and statistical inferences (e.g., the\nestimate of correlations and effect sizes in regressions). This paper proposes\na Bayesian approach to study the effects of algorithmic errors on key\nscientific questions, including the effect of siblings on children's language\nexperience and the association between children's production and their input.\nIn both the most commonly used \\gls{lena}, and an open-source alternative (the\nVoice Type Classifier from the ACLEW system), we find that classification\nerrors can significantly distort estimates. For instance, automated annotations\nunderestimated the negative effect of siblings on adult input by 20--80\\%,\npotentially placing it below statistical significance thresholds. We further\nshow that a Bayesian calibration approach for recovering unbiased estimates of\neffect sizes can be effective and insightful, but does not provide a fool-proof\nsolution. Both the issue reported and our solution may apply to any classifier\ninvolving event detection and classification with non-zero error rates.",
        "link": "http://arxiv.org/abs/2508.15637v1"
    },
    {
        "id": "2508.15617v1",
        "title": "Trained Miniatures: Low cost, High Efficacy SLMs for Sales & Marketing",
        "authors": [
            "Ishaan Bhola",
            "Mukunda NS",
            "Sravanth Kurmala",
            "Harsh Nandwani",
            "Arihant Jain"
        ],
        "summary": "Large language models (LLMs) excel in text generation; however, these\ncreative elements require heavy computation and are accompanied by a steep\ncost. Especially for targeted applications such as sales and marketing\noutreach, these costs are far from feasible. This paper introduces the concept\nof \"Trained Miniatures\" - Small Language Models(SLMs) fine-tuned for specific,\nhigh-value applications, generating similar domain-specific responses for a\nfraction of the cost.",
        "link": "http://arxiv.org/abs/2508.15617v1"
    },
    {
        "id": "2508.15526v1",
        "title": "SafetyFlow: An Agent-Flow System for Automated LLM Safety Benchmarking",
        "authors": [
            "Xiangyang Zhu",
            "Yuan Tian",
            "Chunyi Li",
            "Kaiwei Zhang",
            "Wei Sun",
            "Guangtao Zhai"
        ],
        "summary": "The rapid proliferation of large language models (LLMs) has intensified the\nrequirement for reliable safety evaluation to uncover model vulnerabilities. To\nthis end, numerous LLM safety evaluation benchmarks are proposed. However,\nexisting benchmarks generally rely on labor-intensive manual curation, which\ncauses excessive time and resource consumption. They also exhibit significant\nredundancy and limited difficulty. To alleviate these problems, we introduce\nSafetyFlow, the first agent-flow system designed to automate the construction\nof LLM safety benchmarks. SafetyFlow can automatically build a comprehensive\nsafety benchmark in only four days without any human intervention by\norchestrating seven specialized agents, significantly reducing time and\nresource cost. Equipped with versatile tools, the agents of SafetyFlow ensure\nprocess and cost controllability while integrating human expertise into the\nautomatic pipeline. The final constructed dataset, SafetyFlowBench, contains\n23,446 queries with low redundancy and strong discriminative power. Our\ncontribution includes the first fully automated benchmarking pipeline and a\ncomprehensive safety benchmark. We evaluate the safety of 49 advanced LLMs on\nour dataset and conduct extensive experiments to validate our efficacy and\nefficiency.",
        "link": "http://arxiv.org/abs/2508.15526v1"
    },
    {
        "id": "2508.15524v1",
        "title": "The Enemy from Within: A Study of Political Delegitimization Discourse in Israeli Political Speech",
        "authors": [
            "Naama Rivlin-Angert",
            "Guy Mor-Lan"
        ],
        "summary": "We present the first large-scale computational study of political\ndelegitimization discourse (PDD), defined as symbolic attacks on the normative\nvalidity of political entities. We curate and manually annotate a novel\nHebrew-language corpus of 10,410 sentences drawn from Knesset speeches\n(1993-2023), Facebook posts (2018-2021), and leading news outlets, of which\n1,812 instances (17.4\\%) exhibit PDD and 642 carry additional annotations for\nintensity, incivility, target type, and affective framing. We introduce a\ntwo-stage classification pipeline combining finetuned encoder models and\ndecoder LLMs. Our best model (DictaLM 2.0) attains an F$_1$ of 0.74 for binary\nPDD detection and a macro-F$_1$ of 0.67 for classification of delegitimization\ncharacteristics. Applying this classifier to longitudinal and cross-platform\ndata, we see a marked rise in PDD over three decades, higher prevalence on\nsocial media versus parliamentary debate, greater use by male than female\npoliticians, and stronger tendencies among right-leaning actors - with\npronounced spikes during election campaigns and major political events. Our\nfindings demonstrate the feasibility and value of automated PDD analysis for\nunderstanding democratic discourse.",
        "link": "http://arxiv.org/abs/2508.15524v1"
    },
    {
        "id": "2508.15487v1",
        "title": "Dream 7B: Diffusion Large Language Models",
        "authors": [
            "Jiacheng Ye",
            "Zhihui Xie",
            "Lin Zheng",
            "Jiahui Gao",
            "Zirui Wu",
            "Xin Jiang",
            "Zhenguo Li",
            "Lingpeng Kong"
        ],
        "summary": "We introduce Dream 7B, the most powerful open diffusion large language model\nto date. Unlike autoregressive (AR) models that generate tokens sequentially,\nDream 7B employs discrete diffusion modeling to refine sequences in parallel\nthrough iterative denoising. Our model consistently outperforms existing\ndiffusion language models on general, mathematical, and coding tasks. Dream 7B\ndemonstrates superior planning abilities and inference flexibility, including\narbitrary-order generation, infilling capabilities, and tunable quality-speed\ntrade-offs. These results are achieved through simple yet effective training\ntechniques, including AR-based LLM initialization and context-adaptive\ntoken-level noise rescheduling. We release both Dream-Base and Dream-Instruct\nto facilitate further research in diffusion-based language modeling.",
        "link": "http://arxiv.org/abs/2508.15487v1"
    },
    {
        "id": "2508.15483v1",
        "title": "HebID: Detecting Social Identities in Hebrew-language Political Text",
        "authors": [
            "Guy Mor-Lan",
            "Naama Rivlin-Angert",
            "Yael R. Kaplan",
            "Tamir Sheafer",
            "Shaul R. Shenhav"
        ],
        "summary": "Political language is deeply intertwined with social identities. While social\nidentities are often shaped by specific cultural contexts and expressed through\nparticular uses of language, existing datasets for group and identity detection\nare predominantly English-centric, single-label and focus on coarse identity\ncategories. We introduce HebID, the first multilabel Hebrew corpus for social\nidentity detection: 5,536 sentences from Israeli politicians' Facebook posts\n(Dec 2018-Apr 2021), manually annotated for twelve nuanced social identities\n(e.g. Rightist, Ultra-Orthodox, Socially-oriented) grounded by survey data. We\nbenchmark multilabel and single-label encoders alongside 2B-9B-parameter\ngenerative LLMs, finding that Hebrew-tuned LLMs provide the best results\n(macro-$F_1$ = 0.74). We apply our classifier to politicians' Facebook posts\nand parliamentary speeches, evaluating differences in popularity, temporal\ntrends, clustering patterns, and gender-related variations in identity\nexpression. We utilize identity choices from a national public survey, enabling\na comparison between identities portrayed in elite discourse and the public's\nidentity priorities. HebID provides a comprehensive foundation for studying\nsocial identities in Hebrew and can serve as a model for similar research in\nother non-English political contexts.",
        "link": "http://arxiv.org/abs/2508.15483v1"
    },
    {
        "id": "2508.15478v1",
        "title": "SLM-Bench: A Comprehensive Benchmark of Small Language Models on Environmental Impacts -- Extended Version",
        "authors": [
            "Nghiem Thanh Pham",
            "Tung Kieu",
            "Duc-Manh Nguyen",
            "Son Ha Xuan",
            "Nghia Duong-Trung",
            "Danh Le-Phuoc"
        ],
        "summary": "Small Language Models (SLMs) offer computational efficiency and\naccessibility, yet a systematic evaluation of their performance and\nenvironmental impact remains lacking. We introduce SLM-Bench, the first\nbenchmark specifically designed to assess SLMs across multiple dimensions,\nincluding accuracy, computational efficiency, and sustainability metrics.\nSLM-Bench evaluates 15 SLMs on 9 NLP tasks using 23 datasets spanning 14\ndomains. The evaluation is conducted on 4 hardware configurations, providing a\nrigorous comparison of their effectiveness. Unlike prior benchmarks, SLM-Bench\nquantifies 11 metrics across correctness, computation, and consumption,\nenabling a holistic assessment of efficiency trade-offs. Our evaluation\nconsiders controlled hardware conditions, ensuring fair comparisons across\nmodels. We develop an open-source benchmarking pipeline with standardized\nevaluation protocols to facilitate reproducibility and further research. Our\nfindings highlight the diverse trade-offs among SLMs, where some models excel\nin accuracy while others achieve superior energy efficiency. SLM-Bench sets a\nnew standard for SLM evaluation, bridging the gap between resource efficiency\nand real-world applicability.",
        "link": "http://arxiv.org/abs/2508.15478v1"
    },
    {
        "id": "2508.15475v1",
        "title": "Influence-driven Curriculum Learning for Pre-training on Limited Data",
        "authors": [
            "Loris Schoenegger",
            "Lukas Thoma",
            "Terra Blevins",
            "Benjamin Roth"
        ],
        "summary": "Curriculum learning, a training technique where data is presented to the\nmodel in order of example difficulty (e.g., from simpler to more complex\ndocuments), has shown limited success for pre-training language models. In this\nwork, we investigate whether curriculum learning becomes competitive if we\nreplace conventional human-centered difficulty metrics with one that more\nclosely corresponds to example difficulty as observed during model training.\nSpecifically, we experiment with sorting training examples by their\n\\textit{training data influence}, a score which estimates the effect of\nindividual training examples on the model's output. Models trained on our\ncurricula are able to outperform ones trained in random order by over 10\npercentage points in benchmarks, confirming that curriculum learning is\nbeneficial for language model pre-training, as long as a more model-centric\nnotion of difficulty is adopted.",
        "link": "http://arxiv.org/abs/2508.15475v1"
    },
    {
        "id": "2508.15474v1",
        "title": "Subjective Behaviors and Preferences in LLM: Language of Browsing",
        "authors": [
            "Sai Sundaresan",
            "Harshita Chopra",
            "Atanu R. Sinha",
            "Koustava Goswami",
            "Nagasai Saketh Naidu",
            "Raghav Karan",
            "N Anushka"
        ],
        "summary": "A Large Language Model (LLM) offers versatility across domains and tasks,\npurportedly benefiting users with a wide variety of behaviors and preferences.\nWe question this perception about an LLM when users have inherently subjective\nbehaviors and preferences, as seen in their ubiquitous and idiosyncratic\nbrowsing of websites or apps. The sequential behavior logs of pages, thus\ngenerated, form something akin to each user's self-constructed \"language\",\nalbeit without the structure and grammar imbued in natural languages. We ask:\n(i) Can a small LM represent the \"language of browsing\" better than a large LM?\n(ii) Can an LM with a single set of parameters (or, single LM) adequately\ncapture myriad users' heterogeneous, subjective behaviors and preferences?\n(iii) Can a single LM with high average performance, yield low variance in\nperformance to make alignment good at user level? We introduce clusterwise LM\ntraining, HeTLM (Heterogeneity aware Training of Language Model), appropriate\nfor subjective behaviors. We find that (i) a small LM trained using a\npage-level tokenizer outperforms large pretrained or finetuned LMs; (ii) HeTLM\nwith heterogeneous cluster specific set of parameters outperforms a single LM\nof the same family, controlling for the number of parameters; and (iii) a\nhigher mean and a lower variance in generation ensues, implying improved\nalignment.",
        "link": "http://arxiv.org/abs/2508.15474v1"
    },
    {
        "id": "2508.15471v1",
        "title": "SLM4Offer: Personalized Marketing Offer Generation Using Contrastive Learning Based Fine-Tuning",
        "authors": [
            "Vedasamhitha Challapalli",
            "Konduru Venkat Sai",
            "Piyush Pratap Singh",
            "Rupesh Prasad",
            "Arvind Maurya",
            "Atul Singh"
        ],
        "summary": "Personalized marketing has emerged as a pivotal strategy for enhancing\ncustomer engagement and driving business growth. Academic and industry efforts\nhave predominantly focused on recommendation systems and personalized\nadvertisements. Nonetheless, this facet of personalization holds significant\npotential for increasing conversion rates and improving customer satisfaction.\nPrior studies suggest that well-executed personalization strategies can boost\nrevenue by up to 40 percent, underscoring the strategic importance of\ndeveloping intelligent, data-driven approaches for offer generation. This work\nintroduces SLM4Offer, a generative AI model for personalized offer generation,\ndeveloped by fine-tuning a pre-trained encoder-decoder language model,\nspecifically Google's Text-to-Text Transfer Transformer (T5-Small 60M) using a\ncontrastive learning approach. SLM4Offer employs InfoNCE (Information\nNoise-Contrastive Estimation) loss to align customer personas with relevant\noffers in a shared embedding space. A key innovation in SLM4Offer lies in the\nadaptive learning behaviour introduced by contrastive loss, which reshapes the\nlatent space during training and enhances the model's generalizability. The\nmodel is fine-tuned and evaluated on a synthetic dataset designed to simulate\ncustomer behaviour and offer acceptance patterns. Experimental results\ndemonstrate a 17 percent improvement in offer acceptance rate over a supervised\nfine-tuning baseline, highlighting the effectiveness of contrastive objectives\nin advancing personalized marketing.",
        "link": "http://arxiv.org/abs/2508.15471v1"
    },
    {
        "id": "2508.15464v1",
        "title": "RadReason: Radiology Report Evaluation Metric with Reasons and Sub-Scores",
        "authors": [
            "Yingshu Li",
            "Yunyi Liu",
            "Lingqiao Liu",
            "Lei Wang",
            "Luping Zhou"
        ],
        "summary": "Evaluating automatically generated radiology reports remains a fundamental\nchallenge due to the lack of clinically grounded, interpretable, and\nfine-grained metrics. Existing methods either produce coarse overall scores or\nrely on opaque black-box models, limiting their usefulness in real-world\nclinical workflows. We introduce RadReason, a novel evaluation framework for\nradiology reports that not only outputs fine-grained sub-scores across six\nclinically defined error types, but also produces human-readable justifications\nthat explain the rationale behind each score. Our method builds on Group\nRelative Policy Optimization and incorporates two key innovations: (1)\nSub-score Dynamic Weighting, which adaptively prioritizes clinically\nchallenging error types based on live F1 statistics; and (2) Majority-Guided\nAdvantage Scaling, which adjusts policy gradient updates based on prompt\ndifficulty derived from sub-score agreement. Together, these components enable\nmore stable optimization and better alignment with expert clinical judgment.\nExperiments on the ReXVal benchmark show that RadReason surpasses all prior\noffline metrics and achieves parity with GPT-4-based evaluations, while\nremaining explainable, cost-efficient, and suitable for clinical deployment.\nCode will be released upon publication.",
        "link": "http://arxiv.org/abs/2508.15464v1"
    },
    {
        "id": "2508.15456v1",
        "title": "PyTOD: Programmable Task-Oriented Dialogue with Execution Feedback",
        "authors": [
            "Alexandru Coca",
            "Bo-Hsiang Tseng",
            "Pete Boothroyd",
            "Jianpeng Cheng",
            "Mark Gaynor",
            "Zhenxing Zhang",
            "Joe Stacey",
            "Tristan Guigue",
            "Héctor Martinez Alonso",
            "Diarmuid Ó Séaghdha",
            "Anders Johannsen"
        ],
        "summary": "Programmable task-oriented dialogue (TOD) agents enable language models to\nfollow structured dialogue policies, but their effectiveness hinges on accurate\nstate tracking. We present PyTOD, an agent that generates executable code to\ntrack dialogue state and uses policy and execution feedback for efficient error\ncorrection. To this end, PyTOD employs a simple constrained decoding approach,\nusing a language model instead of grammar rules to follow API schemata. This\nleads to state-of-the-art state tracking performance on the challenging SGD\nbenchmark. Our experiments show that PyTOD surpasses strong baselines in both\naccuracy and robust user goal estimation as the dialogue progresses,\ndemonstrating the effectiveness of execution-aware state tracking.",
        "link": "http://arxiv.org/abs/2508.15456v1"
    },
    {
        "id": "2508.15453v1",
        "title": "Principle Methods of Rendering Non-equivalent Words from Uzbek and Dari to Russian and English",
        "authors": [
            "Mohammad Ibrahim Qani"
        ],
        "summary": "These pure languages understanding directly relates to translation knowledge\nwhere linguists and translators need to work and research to eradicate\nmisunderstanding. Misunderstandings mostly appear in non-equivalent words\nbecause there are different local and internal words like food, garment,\ncultural and traditional words and others in every notion. Truly, most of these\nwords do not have equivalent in the target language and these words need to be\nworked and find their equivalent in the target language to fully understand the\nboth languages. The purpose of this research is to introduce the methods of\nrendering non-equivalent words professionally from the source language to the\ntarget language and this research has been completed using library-based\nresearch. However, some of these non-equivalent words are already\nprofessionally rendered to the target language but still there many other words\nto be rendered. As a result, this research paper includes different ways and\nrules of rendering non-equivalent words from source language to the target\nlanguage and 25 non-equvalent words have been rendered from Dar & Uzbek into\nEnglish and Russian languages.",
        "link": "http://arxiv.org/abs/2508.15453v1"
    },
    {
        "id": "2508.15440v1",
        "title": "M-HELP: Using Social Media Data to Detect Mental Health Help-Seeking Signals",
        "authors": [
            "MSVPJ Sathvik",
            "Zuhair Hasan Shaik",
            "Vivek Gupta"
        ],
        "summary": "Mental health disorders are a global crisis. While various datasets exist for\ndetecting such disorders, there remains a critical gap in identifying\nindividuals actively seeking help. This paper introduces a novel dataset,\nM-Help, specifically designed to detect help-seeking behavior on social media.\nThe dataset goes beyond traditional labels by identifying not only help-seeking\nactivity but also specific mental health disorders and their underlying causes,\nsuch as relationship challenges or financial stressors. AI models trained on\nM-Help can address three key tasks: identifying help-seekers, diagnosing mental\nhealth conditions, and uncovering the root causes of issues.",
        "link": "http://arxiv.org/abs/2508.15440v1"
    },
    {
        "id": "2508.15432v1",
        "title": "GraSP: A Unified Graph-Based Framework for Scalable Generation, Quality Tagging, and Management of Synthetic Data for SFT and DPO",
        "authors": [
            "Bidyapati Pradhan",
            "Surajit Dasgupta",
            "Amit Kumar Saha",
            "Omkar Anustoop",
            "Sriram Puttagunta",
            "Vipul Mittal",
            "Gopal Sarda"
        ],
        "summary": "The advancement of large language models (LLMs) is critically dependent on\nthe availability of high-quality datasets for Supervised Fine-Tuning (SFT),\nalignment tasks like Direct Preference Optimization (DPO), etc. In this work,\nwe present a comprehensive synthetic data generation framework that facilitates\nscalable, configurable, and high-fidelity generation of synthetic data tailored\nfor these training paradigms. Our approach employs a modular and\nconfiguration-based pipeline capable of modeling complex dialogue flows with\nminimal manual intervention. This framework uses a dual-stage quality tagging\nmechanism, combining heuristic rules and LLM-based evaluations, to\nautomatically filter and score data extracted from OASST-formatted\nconversations, ensuring the curation of high-quality dialogue samples. The\nresulting datasets are structured under a flexible schema supporting both SFT\nand DPO use cases, enabling seamless integration into diverse training\nworkflows. Together, these innovations offer a robust solution for generating\nand managing synthetic conversational data at scale, significantly reducing the\noverhead of data preparation in LLM training pipelines.",
        "link": "http://arxiv.org/abs/2508.15432v1"
    },
    {
        "id": "2508.15421v1",
        "title": "A Study of Privacy-preserving Language Modeling Approaches",
        "authors": [
            "Pritilata Saha",
            "Abhirup Sinha"
        ],
        "summary": "Recent developments in language modeling have increased their use in various\napplications and domains. Language models, often trained on sensitive data, can\nmemorize and disclose this information during privacy attacks, raising concerns\nabout protecting individuals' privacy rights. Preserving privacy in language\nmodels has become a crucial area of research, as privacy is one of the\nfundamental human rights. Despite its significance, understanding of how much\nprivacy risk these language models possess and how it can be mitigated is still\nlimited. This research addresses this by providing a comprehensive study of the\nprivacy-preserving language modeling approaches. This study gives an in-depth\noverview of these approaches, highlights their strengths, and investigates\ntheir limitations. The outcomes of this study contribute to the ongoing\nresearch on privacy-preserving language modeling, providing valuable insights\nand outlining future research directions.",
        "link": "http://arxiv.org/abs/2508.15421v1"
    },
    {
        "id": "2508.15418v1",
        "title": "LLaSO: A Foundational Framework for Reproducible Research in Large Language and Speech Model",
        "authors": [
            "Yirong Sun",
            "Yizhong Geng",
            "Peidong Wei",
            "Yanjun Chen",
            "Jinghan Yang",
            "Rongfei Chen",
            "Wei Zhang",
            "Xiaoyu Shen"
        ],
        "summary": "The development of Large Speech-Language Models (LSLMs) has been slowed by\nfragmented architectures and a lack of transparency, hindering the systematic\ncomparison and reproducibility of research. Unlike in the vision-language\ndomain, the LSLM field suffers from the common practice of releasing model\nweights without their corresponding training data and configurations. To\naddress these critical gaps, we introduce LLaSO, the first fully open,\nend-to-end framework for large-scale speech-language modeling. LLaSO provides\nthe community with three essential resources: (1) LLaSO-Align, a 12M-instance\nspeech-text alignment corpus; (2) LLaSO-Instruct, a 13.5M-instance multi-task\ninstruction-tuning dataset; and (3) LLaSO-Eval, a reproducible benchmark for\nstandardized evaluation. To validate our framework, we build and release\nLLaSO-Base, a 3.8B-parameter reference model trained exclusively on our public\ndata. It achieves a normalized score of 0.72, establishing a strong,\nreproducible baseline that surpasses comparable models. Our analysis reveals\nthat while broader training coverage enhances performance, significant\ngeneralization gaps persist on unseen tasks, particularly in pure audio\nscenarios. By releasing the complete stack of data, benchmarks, and models,\nLLaSO establishes a foundational open standard to unify research efforts and\naccelerate community-driven progress in LSLMs. We release the code, dataset,\npretrained models, and results in https://github.com/EIT-NLP/LLaSO.",
        "link": "http://arxiv.org/abs/2508.15418v1"
    },
    {
        "id": "2508.15411v1",
        "title": "Foundational Design Principles and Patterns for Building Robust and Adaptive GenAI-Native Systems",
        "authors": [
            "Frederik Vandeputte"
        ],
        "summary": "Generative AI (GenAI) has emerged as a transformative technology,\ndemonstrating remarkable capabilities across diverse application domains.\nHowever, GenAI faces several major challenges in developing reliable and\nefficient GenAI-empowered systems due to its unpredictability and inefficiency.\nThis paper advocates for a paradigm shift: future GenAI-native systems should\nintegrate GenAI's cognitive capabilities with traditional software engineering\nprinciples to create robust, adaptive, and efficient systems.\n  We introduce foundational GenAI-native design principles centered around five\nkey pillars -- reliability, excellence, evolvability, self-reliance, and\nassurance -- and propose architectural patterns such as GenAI-native cells,\norganic substrates, and programmable routers to guide the creation of resilient\nand self-evolving systems. Additionally, we outline the key ingredients of a\nGenAI-native software stack and discuss the impact of these systems from\ntechnical, user adoption, economic, and legal perspectives, underscoring the\nneed for further validation and experimentation. Our work aims to inspire\nfuture research and encourage relevant communities to implement and refine this\nconceptual framework.",
        "link": "http://arxiv.org/abs/2508.15411v1"
    },
    {
        "id": "2508.15407v1",
        "title": "When Audio and Text Disagree: Revealing Text Bias in Large Audio-Language Models",
        "authors": [
            "Cheng Wang",
            "Gelei Deng",
            "Xianglin Yang",
            "Han Qiu",
            "Tianwei Zhang"
        ],
        "summary": "Large Audio-Language Models (LALMs) are enhanced with audio perception\ncapabilities, enabling them to effectively process and understand multimodal\ninputs that combine audio and text. However, their performance in handling\nconflicting information between audio and text modalities remains largely\nunexamined. This paper introduces MCR-BENCH, the first comprehensive benchmark\nspecifically designed to evaluate how LALMs prioritize information when\npresented with inconsistent audio-text pairs. Through extensive evaluation\nacross diverse audio understanding tasks, we reveal a concerning phenomenon:\nwhen inconsistencies exist between modalities, LALMs display a significant bias\ntoward textual input, frequently disregarding audio evidence. This tendency\nleads to substantial performance degradation in audio-centric tasks and raises\nimportant reliability concerns for real-world applications. We further\ninvestigate the influencing factors of text bias, and explore mitigation\nstrategies through supervised finetuning, and analyze model confidence patterns\nthat reveal persistent overconfidence even with contradictory inputs. These\nfindings underscore the need for improved modality balance during training and\nmore sophisticated fusion mechanisms to enhance the robustness when handling\nconflicting multi-modal inputs. The project is available at\nhttps://github.com/WangCheng0116/MCR-BENCH.",
        "link": "http://arxiv.org/abs/2508.15407v1"
    },
    {
        "id": "2508.15396v1",
        "title": "Attribution, Citation, and Quotation: A Survey of Evidence-based Text Generation with Large Language Models",
        "authors": [
            "Tobias Schreieder",
            "Tim Schopf",
            "Michael Färber"
        ],
        "summary": "The increasing adoption of large language models (LLMs) has been accompanied\nby growing concerns regarding their reliability and trustworthiness. As a\nresult, a growing body of research focuses on evidence-based text generation\nwith LLMs, aiming to link model outputs to supporting evidence to ensure\ntraceability and verifiability. However, the field is fragmented due to\ninconsistent terminology, isolated evaluation practices, and a lack of unified\nbenchmarks. To bridge this gap, we systematically analyze 134 papers, introduce\na unified taxonomy of evidence-based text generation with LLMs, and investigate\n300 evaluation metrics across seven key dimensions. Thereby, we focus on\napproaches that use citations, attribution, or quotations for evidence-based\ntext generation. Building on this, we examine the distinctive characteristics\nand representative methods in the field. Finally, we highlight open challenges\nand outline promising directions for future work.",
        "link": "http://arxiv.org/abs/2508.15396v1"
    },
    {
        "id": "2508.15392v1",
        "title": "CITE: A Comprehensive Benchmark for Heterogeneous Text-Attributed Graphs on Catalytic Materials",
        "authors": [
            "Chenghao Zhang",
            "Qingqing Long",
            "Ludi Wang",
            "Wenjuan Cui",
            "Jianjun Yu",
            "Yi Du"
        ],
        "summary": "Text-attributed graphs(TAGs) are pervasive in real-world systems,where each\nnode carries its own textual features. In many cases these graphs are\ninherently heterogeneous, containing multiple node types and diverse edge\ntypes. Despite the ubiquity of such heterogeneous TAGs, there remains a lack of\nlarge-scale benchmark datasets. This shortage has become a critical bottleneck,\nhindering the development and fair comparison of representation learning\nmethods on heterogeneous text-attributed graphs. In this paper, we introduce\nCITE - Catalytic Information Textual Entities Graph, the first and largest\nheterogeneous text-attributed citation graph benchmark for catalytic materials.\nCITE comprises over 438K nodes and 1.2M edges, spanning four relation types. In\naddition, we establish standardized evaluation procedures and conduct extensive\nbenchmarking on the node classification task, as well as ablation experiments\non the heterogeneous and textual properties of CITE. We compare four classes of\nlearning paradigms, including homogeneous graph models, heterogeneous graph\nmodels, LLM(Large Language Model)-centric models, and LLM+Graph models. In a\nnutshell, we provide (i) an overview of the CITE dataset, (ii) standardized\nevaluation protocols, and (iii) baseline and ablation experiments across\ndiverse modeling paradigms.",
        "link": "http://arxiv.org/abs/2508.15392v1"
    },
    {
        "id": "2508.15390v1",
        "title": "Exploiting Vocabulary Frequency Imbalance in Language Model Pre-training",
        "authors": [
            "Woojin Chung",
            "Jeonghoon Kim"
        ],
        "summary": "Large language models are trained with tokenizers, and the resulting token\ndistribution is highly imbalanced: a few words dominate the stream while most\noccur rarely. Recent practice favors ever-larger vocabularies, but the source\nof the benefit is unclear. We conduct a controlled study that scales the\nlanguage model's vocabulary from 24K to 196K while holding data, compute, and\noptimization fixed. We first quantify the complexity of tokenized text,\nformalized via Kolmogorov complexity, and show that larger vocabularies reduce\nthis complexity. Above 24K, every common word is already a single token, so\nfurther growth mainly deepens the relative token-frequency imbalance. A\nword-level loss decomposition shows that larger vocabularies reduce\ncross-entropy almost exclusively by lowering uncertainty on the 2,500 most\nfrequent words, even though loss on the rare tail rises. Constraining input and\noutput embedding norms to attenuate the effect of token-frequency imbalance\nreverses the gain, directly showing that the model exploits rather than suffers\nfrom imbalance. Because the same frequent words cover roughly 77% of tokens in\ndownstream benchmarks, this training advantage transfers intact. We also show\nthat enlarging model parameters with a fixed vocabulary yields the same\nfrequent-word benefit. Our results reframe \"bigger vocabularies help\" as\n\"lowering the complexity of tokenized text helps,\" providing a simple,\nprincipled lever for tokenizer-model co-design and clarifying the loss dynamics\nthat govern language-model scaling in pre-training.",
        "link": "http://arxiv.org/abs/2508.15390v1"
    },
    {
        "id": "2508.15371v1",
        "title": "Confidence-Modulated Speculative Decoding for Large Language Models",
        "authors": [
            "Jaydip Sen",
            "Subhasis Dasgupta",
            "Hetvi Waghela"
        ],
        "summary": "Speculative decoding has emerged as an effective approach for accelerating\nautoregressive inference by parallelizing token generation through a\ndraft-then-verify paradigm. However, existing methods rely on static drafting\nlengths and rigid verification criteria, limiting their adaptability across\nvarying model uncertainties and input complexities. This paper proposes an\ninformation-theoretic framework for speculative decoding based on\nconfidence-modulated drafting. By leveraging entropy and margin-based\nuncertainty measures over the drafter's output distribution, the proposed\nmethod dynamically adjusts the number of speculatively generated tokens at each\niteration. This adaptive mechanism reduces rollback frequency, improves\nresource utilization, and maintains output fidelity. Additionally, the\nverification process is modulated using the same confidence signals, enabling\nmore flexible acceptance of drafted tokens without sacrificing generation\nquality. Experiments on machine translation and summarization tasks demonstrate\nsignificant speedups over standard speculative decoding while preserving or\nimproving BLEU and ROUGE scores. The proposed approach offers a principled,\nplug-in method for efficient and robust decoding in large language models under\nvarying conditions of uncertainty.",
        "link": "http://arxiv.org/abs/2508.15371v1"
    },
    {
        "id": "2508.15370v1",
        "title": "Unveiling Trust in Multimodal Large Language Models: Evaluation, Analysis, and Mitigation",
        "authors": [
            "Yichi Zhang",
            "Yao Huang",
            "Yifan Wang",
            "Yitong Sun",
            "Chang Liu",
            "Zhe Zhao",
            "Zhengwei Fang",
            "Huanran Chen",
            "Xiao Yang",
            "Xingxing Wei",
            "Hang Su",
            "Yinpeng Dong",
            "Jun Zhu"
        ],
        "summary": "The trustworthiness of Multimodal Large Language Models (MLLMs) remains an\nintense concern despite the significant progress in their capabilities.\nExisting evaluation and mitigation approaches often focus on narrow aspects and\noverlook risks introduced by the multimodality. To tackle these challenges, we\npropose MultiTrust-X, a comprehensive benchmark for evaluating, analyzing, and\nmitigating the trustworthiness issues of MLLMs. We define a three-dimensional\nframework, encompassing five trustworthiness aspects which include\ntruthfulness, robustness, safety, fairness, and privacy; two novel risk types\ncovering multimodal risks and cross-modal impacts; and various mitigation\nstrategies from the perspectives of data, model architecture, training, and\ninference algorithms. Based on the taxonomy, MultiTrust-X includes 32 tasks and\n28 curated datasets, enabling holistic evaluations over 30 open-source and\nproprietary MLLMs and in-depth analysis with 8 representative mitigation\nmethods. Our extensive experiments reveal significant vulnerabilities in\ncurrent models, including a gap between trustworthiness and general\ncapabilities, as well as the amplification of potential risks in base LLMs by\nboth multimodal training and inference. Moreover, our controlled analysis\nuncovers key limitations in existing mitigation strategies that, while some\nmethods yield improvements in specific aspects, few effectively address overall\ntrustworthiness, and many introduce unexpected trade-offs that compromise model\nutility. These findings also provide practical insights for future\nimprovements, such as the benefits of reasoning to better balance safety and\nperformance. Based on these insights, we introduce a Reasoning-Enhanced Safety\nAlignment (RESA) approach that equips the model with chain-of-thought reasoning\nability to discover the underlying risks, achieving state-of-the-art results.",
        "link": "http://arxiv.org/abs/2508.15370v1"
    },
    {
        "id": "2508.15361v1",
        "title": "A Survey on Large Language Model Benchmarks",
        "authors": [
            "Shiwen Ni",
            "Guhong Chen",
            "Shuaimin Li",
            "Xuanang Chen",
            "Siyi Li",
            "Bingli Wang",
            "Qiyao Wang",
            "Xingjian Wang",
            "Yifan Zhang",
            "Liyang Fan",
            "Chengming Li",
            "Ruifeng Xu",
            "Le Sun",
            "Min Yang"
        ],
        "summary": "In recent years, with the rapid development of the depth and breadth of large\nlanguage models' capabilities, various corresponding evaluation benchmarks have\nbeen emerging in increasing numbers. As a quantitative assessment tool for\nmodel performance, benchmarks are not only a core means to measure model\ncapabilities but also a key element in guiding the direction of model\ndevelopment and promoting technological innovation. We systematically review\nthe current status and development of large language model benchmarks for the\nfirst time, categorizing 283 representative benchmarks into three categories:\ngeneral capabilities, domain-specific, and target-specific. General capability\nbenchmarks cover aspects such as core linguistics, knowledge, and reasoning;\ndomain-specific benchmarks focus on fields like natural sciences, humanities\nand social sciences, and engineering technology; target-specific benchmarks pay\nattention to risks, reliability, agents, etc. We point out that current\nbenchmarks have problems such as inflated scores caused by data contamination,\nunfair evaluation due to cultural and linguistic biases, and lack of evaluation\non process credibility and dynamic environments, and provide a referable design\nparadigm for future benchmark innovation.",
        "link": "http://arxiv.org/abs/2508.15361v1"
    },
    {
        "id": "2508.15357v1",
        "title": "KG-EDAS: A Meta-Metric Framework for Evaluating Knowledge Graph Completion Models",
        "authors": [
            "Haji Gul",
            "Abul Ghani Naim",
            "Ajaz Ahmad Bhat"
        ],
        "summary": "Knowledge Graphs (KGs) enable applications in various domains such as\nsemantic search, recommendation systems, and natural language processing. KGs\nare often incomplete, missing entities and relations, an issue addressed by\nKnowledge Graph Completion (KGC) methods that predict missing elements.\nDifferent evaluation metrics, such as Mean Reciprocal Rank (MRR), Mean Rank\n(MR), and Hit@k, are commonly used to assess the performance of such KGC\nmodels. A major challenge in evaluating KGC models, however, lies in comparing\ntheir performance across multiple datasets and metrics. A model may outperform\nothers on one dataset but underperform on another, making it difficult to\ndetermine overall superiority. Moreover, even within a single dataset,\ndifferent metrics such as MRR and Hit@1 can yield conflicting rankings, where\none model excels in MRR while another performs better in Hit@1, further\ncomplicating model selection for downstream tasks. These inconsistencies hinder\nholistic comparisons and highlight the need for a unified meta-metric that\nintegrates performance across all metrics and datasets to enable a more\nreliable and interpretable evaluation framework. To address this need, we\npropose KG Evaluation based on Distance from Average Solution (EDAS), a robust\nand interpretable meta-metric that synthesizes model performance across\nmultiple datasets and diverse evaluation criteria into a single normalized\nscore ($M_i \\in [0,1]$). Unlike traditional metrics that focus on isolated\naspects of performance, EDAS offers a global perspective that supports more\ninformed model selection and promotes fairness in cross-dataset evaluation.\nExperimental results on benchmark datasets such as FB15k-237 and WN18RR\ndemonstrate that EDAS effectively integrates multi-metric, multi-dataset\nperformance into a unified ranking, offering a consistent, robust, and\ngeneralizable framework for evaluating KGC models.",
        "link": "http://arxiv.org/abs/2508.15357v1"
    },
    {
        "id": "2508.15338v1",
        "title": "DiagECG: An LLM-Driven Framework for Diagnostic Reasoning via Discretized ECG Tokenization",
        "authors": [
            "Jinning Yang",
            "Wen Shi"
        ],
        "summary": "Electrocardiography plays a central role in cardiovascular diagnostics, yet\nexisting automated approaches often struggle to generalize across clinical\ntasks and offer limited support for open-ended reasoning. We present DiagECG, a\nnovel framework that integrates time-series and language modeling by enabling\nlarge language models to process 12-lead ECG signals for clinical text\ngeneration tasks. Our approach discretizes continuous ECG embeddings into\nsymbolic tokens using a lead-independent encoder and quantization module. These\ntokens are then used to extend the vocabulary of LLM, allowing the model to\nhandle both ECG and natural language inputs in a unified manner. To bridge the\nmodality gap, we pretrain the model on an autoregressive ECG forecasting task,\nenabling the LLM to model temporal dynamics using its native language modeling\ncapabilities. Finally, we perform instruction tuning on both ECG question\nanswering and diagnostic report generation. Without modifying the core model,\nDiagECG achieves strong performance across tasks while maintaining\ngeneralization to out-of-distribution settings. Extensive experiments\ndemonstrate the effectiveness of each component and highlight the potential of\nintegrating symbolic ECG representations into LLMs for medical reasoning.",
        "link": "http://arxiv.org/abs/2508.15338v1"
    },
    {
        "id": "2508.15316v1",
        "title": "CUPE: Contextless Universal Phoneme Encoder for Language-Agnostic Speech Processing",
        "authors": [
            "Abdul Rehman",
            "Jian-Jun Zhang",
            "Xiaosong Yang"
        ],
        "summary": "Universal phoneme recognition typically requires analyzing long speech\nsegments and language-specific patterns. Many speech processing tasks require\npure phoneme representations free from contextual influence, which motivated\nour development of CUPE - a lightweight model that captures key phoneme\nfeatures in just 120 milliseconds, about one phoneme's length. CUPE processes\nshort, fixed-width windows independently and, despite fewer parameters than\ncurrent approaches, achieves competitive cross-lingual performance by learning\nfundamental acoustic patterns common to all languages. Our extensive evaluation\nthrough supervised and self-supervised training on diverse languages, including\nzero-shot tests on the UCLA Phonetic Corpus, demonstrates strong cross-lingual\ngeneralization and reveals that effective universal speech processing is\npossible through modeling basic acoustic patterns within phoneme-length\nwindows.",
        "link": "http://arxiv.org/abs/2508.15316v1"
    },
    {
        "id": "2508.15310v1",
        "title": "IPIGuard: A Novel Tool Dependency Graph-Based Defense Against Indirect Prompt Injection in LLM Agents",
        "authors": [
            "Hengyu An",
            "Jinghuai Zhang",
            "Tianyu Du",
            "Chunyi Zhou",
            "Qingming Li",
            "Tao Lin",
            "Shouling Ji"
        ],
        "summary": "Large language model (LLM) agents are widely deployed in real-world\napplications, where they leverage tools to retrieve and manipulate external\ndata for complex tasks. However, when interacting with untrusted data sources\n(e.g., fetching information from public websites), tool responses may contain\ninjected instructions that covertly influence agent behaviors and lead to\nmalicious outcomes, a threat referred to as Indirect Prompt Injection (IPI).\nExisting defenses typically rely on advanced prompting strategies or auxiliary\ndetection models. While these methods have demonstrated some effectiveness,\nthey fundamentally rely on assumptions about the model's inherent security,\nwhich lacks structural constraints on agent behaviors. As a result, agents\nstill retain unrestricted access to tool invocations, leaving them vulnerable\nto stronger attack vectors that can bypass the security guardrails of the\nmodel. To prevent malicious tool invocations at the source, we propose a novel\ndefensive task execution paradigm, called IPIGuard, which models the agents'\ntask execution process as a traversal over a planned Tool Dependency Graph\n(TDG). By explicitly decoupling action planning from interaction with external\ndata, IPIGuard significantly reduces unintended tool invocations triggered by\ninjected instructions, thereby enhancing robustness against IPI attacks.\nExperiments on the AgentDojo benchmark show that IPIGuard achieves a superior\nbalance between effectiveness and robustness, paving the way for the\ndevelopment of safer agentic systems in dynamic environments.",
        "link": "http://arxiv.org/abs/2508.15310v1"
    },
    {
        "id": "2508.15294v1",
        "title": "Multiple Memory Systems for Enhancing the Long-term Memory of Agent",
        "authors": [
            "Gaoke Zhang",
            "Bo Wang",
            "Yunlong Ma",
            "Dongming Zhao",
            "Zifei Yu"
        ],
        "summary": "An agent powered by large language models have achieved impressive results,\nbut effectively handling the vast amounts of historical data generated during\ninteractions remains a challenge. The current approach is to design a memory\nmodule for the agent to process these data. However, existing methods, such as\nMemoryBank and A-MEM, have poor quality of stored memory content, which affects\nrecall performance and response quality. In order to better construct\nhigh-quality long-term memory content, we have designed a multiple memory\nsystem (MMS) inspired by cognitive psychology theory. The system processes\nshort-term memory to multiple long-term memory fragments, and constructs\nretrieval memory units and contextual memory units based on these fragments,\nwith a one-to-one correspondence between the two. During the retrieval phase,\nMMS will match the most relevant retrieval memory units based on the user's\nquery. Then, the corresponding contextual memory units is obtained as the\ncontext for the response stage to enhance knowledge, thereby effectively\nutilizing historical data. Experiments on LoCoMo dataset compared our method\nwith three others, proving its effectiveness. Ablation studies confirmed the\nrationality of our memory units. We also analyzed the robustness regarding the\nnumber of selected memory segments and the storage overhead, demonstrating its\npractical value.",
        "link": "http://arxiv.org/abs/2508.15294v1"
    },
    {
        "id": "2508.15291v1",
        "title": "Evaluating Knowledge Graph Complexity via Semantic, Spectral, and Structural Metrics for Link Prediction",
        "authors": [
            "Haji Gul",
            "Abul Ghani Naim",
            "Ajaz Ahmad Bhat"
        ],
        "summary": "Understanding dataset complexity is fundamental to evaluating and comparing\nlink prediction models on knowledge graphs (KGs). While the Cumulative Spectral\nGradient (CSG) metric, derived from probabilistic divergence between classes\nwithin a spectral clustering framework, has been proposed as a classifier\nagnostic complexity metric purportedly scaling with class cardinality and\ncorrelating with downstream performance, it has not been evaluated in KG\nsettings so far. In this work, we critically examine CSG in the context of\nmulti relational link prediction, incorporating semantic representations via\ntransformer derived embeddings. Contrary to prior claims, we find that CSG is\nhighly sensitive to parametrisation and does not robustly scale with the number\nof classes. Moreover, it exhibits weak or inconsistent correlation with\nstandard performance metrics such as Mean Reciprocal Rank (MRR) and Hit@1. To\ndeepen the analysis, we introduce and benchmark a set of structural and\nsemantic KG complexity metrics. Our findings reveal that global and local\nrelational ambiguity captured via Relation Entropy, node level Maximum Relation\nDiversity, and Relation Type Cardinality exhibit strong inverse correlations\nwith MRR and Hit@1, suggesting these as more faithful indicators of task\ndifficulty. Conversely, graph connectivity measures such as Average Degree,\nDegree Entropy, PageRank, and Eigenvector Centrality correlate positively with\nHit@10. Our results demonstrate that CSGs purported stability and\ngeneralization predictive power fail to hold in link prediction settings and\nunderscore the need for more stable, interpretable, and task-aligned measures\nof dataset complexity in knowledge driven learning.",
        "link": "http://arxiv.org/abs/2508.15291v1"
    },
    {
        "id": "2508.15283v1",
        "title": "Adversarial Attacks against Neural Ranking Models via In-Context Learning",
        "authors": [
            "Amin Bigdeli",
            "Negar Arabzadeh",
            "Ebrahim Bagheri",
            "Charles L. A. Clarke"
        ],
        "summary": "While neural ranking models (NRMs) have shown high effectiveness, they remain\nsusceptible to adversarial manipulation. In this work, we introduce Few-Shot\nAdversarial Prompting (FSAP), a novel black-box attack framework that leverages\nthe in-context learning capabilities of Large Language Models (LLMs) to\ngenerate high-ranking adversarial documents. Unlike previous approaches that\nrely on token-level perturbations or manual rewriting of existing documents,\nFSAP formulates adversarial attacks entirely through few-shot prompting,\nrequiring no gradient access or internal model instrumentation. By conditioning\nthe LLM on a small support set of previously observed harmful examples, FSAP\nsynthesizes grammatically fluent and topically coherent documents that subtly\nembed false or misleading information and rank competitively against authentic\ncontent. We instantiate FSAP in two modes: FSAP-IntraQ, which leverages harmful\nexamples from the same query to enhance topic fidelity, and FSAP-InterQ, which\nenables broader generalization by transferring adversarial patterns across\nunrelated queries. Our experiments on the TREC 2020 and 2021 Health\nMisinformation Tracks, using four diverse neural ranking models, reveal that\nFSAP-generated documents consistently outrank credible, factually accurate\ndocuments. Furthermore, our analysis demonstrates that these adversarial\noutputs exhibit strong stance alignment and low detectability, posing a\nrealistic and scalable threat to neural retrieval systems. FSAP also\neffectively generalizes across both proprietary and open-source LLMs.",
        "link": "http://arxiv.org/abs/2508.15283v1"
    },
    {
        "id": "2508.15276v1",
        "title": "AmbiSQL: Interactive Ambiguity Detection and Resolution for Text-to-SQL",
        "authors": [
            "Zhongjun Ding",
            "Yin Lin",
            "Tianjing Zeng"
        ],
        "summary": "Text-to-SQL systems translate natural language questions into SQL queries,\nproviding substantial value for non-expert users. While large language models\n(LLMs) show promising results for this task, they remain error-prone. Query\nambiguity has been recognized as a major obstacle for LLM-based Text-to-SQL\nsystems, leading to misinterpretation of user intent and inaccurate SQL\ngeneration. We demonstrate AmbiSQL, an interactive system that automatically\ndetects query ambiguities and guides users through intuitive multiple-choice\nquestions to clarify their intent. Our approach introduces a fine-grained\nambiguity taxonomy for identifying ambiguities that affect database element\nmapping and LLM reasoning, then incorporates user feedback to rewrite ambiguous\nquestions. Evaluation on an ambiguous query dataset shows that AmbiSQL achieves\n87.2% precision in ambiguity detection and improves SQL exact match accuracy by\n50% when integrated with Text-to-SQL systems. Our demonstration showcases the\nsignificant performance gains and highlights the system's practical usability.\nCode repo and demonstration are available at:\nhttps://github.com/JustinzjDing/AmbiSQL.",
        "link": "http://arxiv.org/abs/2508.15276v1"
    },
    {
        "id": "2508.15274v1",
        "title": "TComQA: Extracting Temporal Commonsense from Text",
        "authors": [
            "Lekshmi R Nair",
            "Arun Sankar",
            "Koninika Pal"
        ],
        "summary": "Understanding events necessitates grasping their temporal context, which is\noften not explicitly stated in natural language. For example, it is not a\ntrivial task for a machine to infer that a museum tour may last for a few\nhours, but can not take months. Recent studies indicate that even advanced\nlarge language models (LLMs) struggle in generating text that require reasoning\nwith temporal commonsense due to its infrequent explicit mention in text.\nTherefore, automatically mining temporal commonsense for events enables the\ncreation of robust language models. In this work, we investigate the capacity\nof LLMs to extract temporal commonsense from text and evaluate multiple\nexperimental setups to assess their effectiveness. Here, we propose a temporal\ncommonsense extraction pipeline that leverages LLMs to automatically mine\ntemporal commonsense and use it to construct TComQA, a dataset derived from\nSAMSum and RealNews corpora. TComQA has been validated through crowdsourcing\nand achieves over 80\\% precision in extracting temporal commonsense. The model\ntrained with TComQA also outperforms an LLM fine-tuned on existing dataset of\ntemporal question answering task.",
        "link": "http://arxiv.org/abs/2508.15274v1"
    },
    {
        "id": "2508.15253v1",
        "title": "Conflict-Aware Soft Prompting for Retrieval-Augmented Generation",
        "authors": [
            "Eunseong Choi",
            "June Park",
            "Hyeri Lee",
            "Jongwuk Lee"
        ],
        "summary": "Retrieval-augmented generation (RAG) enhances the capabilities of large\nlanguage models (LLMs) by incorporating external knowledge into their input\nprompts. However, when the retrieved context contradicts the LLM's parametric\nknowledge, it often fails to resolve the conflict between incorrect external\ncontext and correct parametric knowledge, known as context-memory conflict. To\ntackle this problem, we introduce Conflict-Aware REtrieval-Augmented Generation\n(CARE), consisting of a context assessor and a base LLM. The context assessor\nencodes compact memory token embeddings from raw context tokens. Through\ngrounded/adversarial soft prompting, the context assessor is trained to discern\nunreliable context and capture a guidance signal that directs reasoning toward\nthe more reliable knowledge source. Extensive experiments show that CARE\neffectively mitigates context-memory conflicts, leading to an average\nperformance gain of 5.0\\% on QA and fact-checking benchmarks, establishing a\npromising direction for trustworthy and adaptive RAG systems.",
        "link": "http://arxiv.org/abs/2508.15253v1"
    },
    {
        "id": "2508.15252v1",
        "title": "Retrieval-Augmented Review Generation for Poisoning Recommender Systems",
        "authors": [
            "Shiyi Yang",
            "Xinshu Li",
            "Guanglin Zhou",
            "Chen Wang",
            "Xiwei Xu",
            "Liming Zhu",
            "Lina Yao"
        ],
        "summary": "Recent studies have shown that recommender systems (RSs) are highly\nvulnerable to data poisoning attacks, where malicious actors inject fake user\nprofiles, including a group of well-designed fake ratings, to manipulate\nrecommendations. Due to security and privacy constraints in practice, attackers\ntypically possess limited knowledge of the victim system and thus need to craft\nprofiles that have transferability across black-box RSs. To maximize the attack\nimpact, the profiles often remains imperceptible. However, generating such\nhigh-quality profiles with the restricted resources is challenging. Some works\nsuggest incorporating fake textual reviews to strengthen the profiles; yet, the\npoor quality of the reviews largely undermines the attack effectiveness and\nimperceptibility under the practical setting.\n  To tackle the above challenges, in this paper, we propose to enhance the\nquality of the review text by harnessing in-context learning (ICL) capabilities\nof multimodal foundation models. To this end, we introduce a demonstration\nretrieval algorithm and a text style transfer strategy to augment the navie\nICL. Specifically, we propose a novel practical attack framework named RAGAN to\ngenerate high-quality fake user profiles, which can gain insights into the\nrobustness of RSs. The profiles are generated by a jailbreaker and\ncollaboratively optimized on an instructional agent and a guardian to improve\nthe attack transferability and imperceptibility. Comprehensive experiments on\nvarious real-world datasets demonstrate that RAGAN achieves the\nstate-of-the-art poisoning attack performance.",
        "link": "http://arxiv.org/abs/2508.15252v1"
    },
    {
        "id": "2508.15250v1",
        "title": "EMNLP: Educator-role Moral and Normative Large Language Models Profiling",
        "authors": [
            "Yilin Jiang",
            "Mingzi Zhang",
            "Sheng Jin",
            "Zengyi Yu",
            "Xiangjie Kong",
            "Binghao Tu"
        ],
        "summary": "Simulating Professions (SP) enables Large Language Models (LLMs) to emulate\nprofessional roles. However, comprehensive psychological and ethical evaluation\nin these contexts remains lacking. This paper introduces EMNLP, an\nEducator-role Moral and Normative LLMs Profiling framework for personality\nprofiling, moral development stage measurement, and ethical risk under soft\nprompt injection. EMNLP extends existing scales and constructs 88\nteacher-specific moral dilemmas, enabling profession-oriented comparison with\nhuman teachers. A targeted soft prompt injection set evaluates compliance and\nvulnerability in teacher SP. Experiments on 12 LLMs show teacher-role LLMs\nexhibit more idealized and polarized personalities than human teachers, excel\nin abstract moral reasoning, but struggle with emotionally complex situations.\nModels with stronger reasoning are more vulnerable to harmful prompt injection,\nrevealing a paradox between capability and safety. The model temperature and\nother hyperparameters have limited influence except in some risk behaviors.\nThis paper presents the first benchmark to assess ethical and psychological\nalignment of teacher-role LLMs for educational AI. Resources are available at\nhttps://e-m-n-l-p.github.io/.",
        "link": "http://arxiv.org/abs/2508.15250v1"
    },
    {
        "id": "2508.15244v1",
        "title": "UniCoM: A Universal Code-Switching Speech Generator",
        "authors": [
            "Sangmin Lee",
            "Woojin Chung",
            "Seyun Um",
            "Hong-Goo Kang"
        ],
        "summary": "Code-switching (CS), the alternation between two or more languages within a\nsingle speaker's utterances, is common in real-world conversations and poses\nsignificant challenges for multilingual speech technology. However, systems\ncapable of handling this phenomenon remain underexplored, primarily due to the\nscarcity of suitable datasets. To resolve this issue, we propose Universal\nCode-Mixer (UniCoM), a novel pipeline for generating high-quality, natural CS\nsamples without altering sentence semantics. Our approach utilizes an algorithm\nwe call Substituting WORDs with Synonyms (SWORDS), which generates CS speech by\nreplacing selected words with their translations while considering their parts\nof speech. Using UniCoM, we construct Code-Switching FLEURS (CS-FLEURS), a\nmultilingual CS corpus designed for automatic speech recognition (ASR) and\nspeech-to-text translation (S2TT). Experimental results show that CS-FLEURS\nachieves high intelligibility and naturalness, performing comparably to\nexisting datasets on both objective and subjective metrics. We expect our\napproach to advance CS speech technology and enable more inclusive multilingual\nsystems.",
        "link": "http://arxiv.org/abs/2508.15244v1"
    },
    {
        "id": "2508.15239v1",
        "title": "WangchanThaiInstruct: An instruction-following Dataset for Culture-Aware, Multitask, and Multi-domain Evaluation in Thai",
        "authors": [
            "Peerat Limkonchotiwat",
            "Pume Tuchinda",
            "Lalita Lowphansirikul",
            "Surapon Nonesung",
            "Panuthep Tasawong",
            "Alham Fikri Aji",
            "Can Udomcharoenchaikit",
            "Sarana Nutanong"
        ],
        "summary": "Large language models excel at instruction-following in English, but their\nperformance in low-resource languages like Thai remains underexplored. Existing\nbenchmarks often rely on translations, missing cultural and domain-specific\nnuances needed for real-world use. We present WangchanThaiInstruct, a\nhuman-authored Thai dataset for evaluation and instruction tuning, covering\nfour professional domains and seven task types. Created through a multi-stage\nquality control process with annotators, domain experts, and AI researchers,\nWangchanThaiInstruct supports two studies: (1) a zero-shot evaluation showing\nperformance gaps on culturally and professionally specific tasks, and (2) an\ninstruction tuning study with ablations isolating the effect of native\nsupervision. Models fine-tuned on WangchanThaiInstruct outperform those using\ntranslated data in both in-domain and out-of-domain benchmarks. These findings\nunderscore the need for culturally and professionally grounded instruction data\nto improve LLM alignment in low-resource, linguistically diverse settings.",
        "link": "http://arxiv.org/abs/2508.15239v1"
    },
    {
        "id": "2508.15229v1",
        "title": "VocabTailor: Dynamic Vocabulary Selection for Downstream Tasks in Small Language Models",
        "authors": [
            "Hanling Zhang",
            "Yayu Zhou",
            "Tongcheng Fang",
            "Zhihang Yuan",
            "Guohao Dai",
            "Yu Wang"
        ],
        "summary": "Small Language Models (SLMs) provide computational advantages in\nresource-constrained environments, yet memory limitations remain a critical\nbottleneck for edge device deployment. A substantial portion of SLMs' memory\nfootprint stems from vocabulary-related components, particularly embeddings and\nlanguage modeling (LM) heads, due to large vocabulary sizes. Existing static\nvocabulary pruning, while reducing memory usage, suffers from rigid,\none-size-fits-all designs that cause information loss from the prefill stage\nand a lack of flexibility. In this work, we identify two key principles\nunderlying the vocabulary reduction challenge: the lexical locality principle,\nthe observation that only a small subset of tokens is required during any\nsingle inference, and the asymmetry in computational characteristics between\nvocabulary-related components of SLM. Based on these insights, we introduce\nVocabTailor, a novel decoupled dynamic vocabulary selection framework that\naddresses memory constraints through offloading embedding and implements a\nhybrid static-dynamic vocabulary selection strategy for LM Head, enabling\non-demand loading of vocabulary components. Comprehensive experiments across\ndiverse downstream tasks demonstrate that VocabTailor achieves a reduction of\nup to 99% in the memory usage of vocabulary-related components with minimal or\nno degradation in task performance, substantially outperforming existing static\nvocabulary pruning.",
        "link": "http://arxiv.org/abs/2508.15229v1"
    }
]